app/controllers/password_resets_controller.rb

  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, :blank)
      render 'edit'
    elsif @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$mQYud8vC5By8HYWiCNhGyuMXP/tmPZWbsjEyifv00W3p835PnELpe"], ["updated_at", "2018-04-16 17:55:09.406519"], ["id", 762146111]]